In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
ser = Series([1,2,3,4], index=['A', 'B', 'C', 'D'])

In [3]:
ser

A    1
B    2
C    3
D    4
dtype: int64

In [4]:
index = ser.index

In [5]:
index

Index(['A', 'B', 'C', 'D'], dtype='object')

In [6]:
index[2:]

Index(['C', 'D'], dtype='object')

In [8]:
from numpy.random import randn

In [10]:
ser2 = ser.reindex(['A', 'B', 'C', 'D', 'E', 'F'])

In [11]:
ser2

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    NaN
dtype: float64

In [13]:
ser2.reindex(['A', 'B', 'C', 'D', 'E', 'F', 'G'], fill_value=0)

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    NaN
G    0.0
dtype: float64

In [14]:
ser3 = Series(['A', 'B', 'C'], index=[0, 5, 10])

In [15]:
ser3

0     A
5     B
10    C
dtype: object

In [18]:
# forward fill
ser3.reindex(range(15), method='ffill')

0     A
1     A
2     A
3     A
4     A
5     B
6     B
7     B
8     B
9     B
10    C
11    C
12    C
13    C
14    C
dtype: object

In [19]:
ser3.drop(0)

5     B
10    C
dtype: object

In [21]:
dframe = DataFrame(np.arange(9).reshape(3,3), index=['A', 'B', 'C'], columns=['x', 'y', 'z'])

In [22]:
dframe

   x  y  z
A  0  1  2
B  3  4  5
C  6  7  8

In [23]:
dframe.drop('A')

   x  y  z
B  3  4  5
C  6  7  8

In [24]:
dframe.drop('z', axis=1)

   x  y
A  0  1
B  3  4
C  6  7

In [25]:
2 * dframe

    x   y   z
A   0   2   4
B   6   8  10
C  12  14  16

In [30]:
dframe['x']

A    0
B    3
C    6
Name: x, dtype: int64

In [31]:
dframe[0:1]

   x  y  z
A  0  1  2

In [32]:
dframe[0:2]['z']

A    2
B    5
Name: z, dtype: int64